// Lab1.1.cpp : Этот файл содержит функцию "main". Здесь начинается и заканчивается выполнение программы.
//

#include <iostream>
#include <stdlib.h>
#include <stdio.h>
#include <locale.h>


int main()
{
    setlocale(LC_ALL, "Russian"); //установка русского языка
    int a; //ввод переменных
    printf("Введите первое число: "); //ввод с клавиатуры
    scanf_s("%d", &a);
    double c;
    double b;
    printf("Введите второе число: ");
    scanf_s("%lf", &b);
    int e;
    c = a * b; //вычисление
    if (a !=0) //ввод условия
    {
        e = (int)c / (double)a; //вычисление значения
        printf("Значение выражения: %d\n", e); //вывод на экран
    }
    else printf("Значение выражения нельзя вычислить, так как делить на ноль нельзя \n"); 
    system("pause");
    return 0;
   
}

// Запуск программы: CTRL+F5 или меню "Отладка" > "Запуск без отладки"
// Отладка программы: F5 или меню "Отладка" > "Запустить отладку"

// Советы по началу работы 
//   1. В окне обозревателя решений можно добавлять файлы и управлять ими.
//   2. В окне Team Explorer можно подключиться к системе управления версиями.
//   3. В окне "Выходные данные" можно просматривать выходные данные сборки и другие сообщения.
//   4. В окне "Список ошибок" можно просматривать ошибки.
//   5. Последовательно выберите пункты меню "Проект" > "Добавить новый элемент", чтобы создать файлы кода, или "Проект" > "Добавить существующий элемент", чтобы добавить в проект существующие файлы кода.
//   6. Чтобы снова открыть этот проект позже, выберите пункты меню "Файл" > "Открыть" > "Проект" и выберите SLN-файл.
